# 18 Вариант
# 1
x = [
    [3, 7, 10, 1],
    [5, 2, 8, 6],
    [4, 12, 3, 9],
    [11, 0, 15, 2]
]

for i in range(4):
    for j in range(4):
        if x[i][j] < 5:
            x[i][j] = 111

print("Массив после замены элементов меньше 5 на 111:")
for row in x:
    print(row)
# 2 
A = [1.5, -3.2, 4.0, -0.1, 7.7, -8.8, 2.3, 0.0, -5.5, 9.9,
     3.1, -2.4, 6.6, -7.7, 8.8, 1.2, -4.4, 3.3, -6.6, 7.7,
     -9.9, 0.1, 2.2, -3.3, 4.4, -5.5, 6.6, -7.7, 8.8, 9.9,
     -1.1, 2.2, -3.3, 4.4, -5.5, 6.6, -7.7, 8.8, 9.9, -10.0]

negative_indices = [index for index, value in enumerate(A) if value < 0]

print("Теріс элементтердің индекстері:")
print(negative_indices)
